{
    "minecraft:ammo_use": "Quantité de munitions utilisée lors du tir d'un arc ou d'une arbalète.",
    "minecraft:armor_effectiveness": "Efficacité de l'armure de la cible lors d'une attaque. 0 signifie totalement inefficace ; 1 signifie totalement efficace.",
    "minecraft:attributes": "Modifie les statistiques du joueur lorsque l'arme est équipée ou tenue.",
    "minecraft:block_experience": "Effectue une opération mathématique sur l'expérience gagnée en cassant un bloc.",
    "minecraft:crossbow_charge_time": "Temps nécessaire pour charger complètement l'arbalète.",
    "minecraft:crossbow_charging_sounds": "Joue un son lorsque l'arbalète est complètement chargée.",
    "minecraft:damage": "Quantité de dégâts infligés par une attaque.",
    "minecraft:damage_immunity": "Confère une immunité aux dégâts sous certaines conditions.",
    "minecraft:damage_protection": "Réduit la quantité de dégâts reçus des attaques.",
    "minecraft:equipment_drops": "Chance que l'équipement tombe d'une entité tuée. La valeur varie de 0 à 1.",
    "minecraft:fishing_luck_bonus": "Augmente la chance du joueur lors de la pêche.",
    "minecraft:fishing_time_reduction": "Réduit le temps nécessaire pour attraper un poisson.",
    "minecraft:hit_block": "Déclenche une action lorsque le joueur ou un projectile frappe un bloc.",
    "minecraft:item_damage": "Quantité de durabilité perdue lorsqu'un objet est endommagé.",
    "minecraft:knockback": "Quantité de recul causée par une attaque.",
    "minecraft:location_changed": "Déclenche une action lorsque le joueur change d'emplacement.",
    "minecraft:mob_experience": "Effectue une opération mathématique sur l'expérience gagnée en tuant un monstre.",
    "minecraft:post_attack": "Déclenche une action après une attaque.",
    "minecraft:prevent_armor_change": "Empêche le joueur de déséquiper son armure.",
    "minecraft:prevent_equipment_drop": "Empêche l'objet de tomber lorsque le joueur meurt.",
    "minecraft:projectile_count": "Augmente le nombre de projectiles tirés.",
    "minecraft:projectile_piercing": "Change le nombre d'entités qu'un projectile peut transpercer.",
    "minecraft:projectile_spawned": "Déclenche une action lorsqu'un projectile est généré.",
    "minecraft:projectile_spread": "Modifie la distance de dispersion entre les projectiles.",
    "minecraft:repair_with_xp": "Effectue une opération mathématique sur la durabilité de l'arme lorsque de l'expérience est gagnée.",
    "minecraft:smash_damage_per_fallen_block": "Effectue une opération mathématique sur les dégâts en fonction du nombre de blocs tombés.",
    "minecraft:tick": "Déclenche une action à chaque tick de jeu.",
    "minecraft:trident_return_acceleration": "Change la vitesse à laquelle un trident revient vers le joueur.",
    "minecraft:trident_sound": "Joue un son lorsque le trident est lancé.",
    "minecraft:trident_spin_attack_strength": "Modifie la force de l'attaque tournoyante du trident."
}
