{
    "dialog.home.title": "Bienvenue dans l'éditeur de packs !",
    "dialog.home.body": "Voxel Studio est conçu pour tout le monde. Aucune connaissance en programmation requise. Modifiez simplement le contenu existant du jeu pour créer votre expérience idéale.",
    "dialog.home.list.1": "Interface intuitive accessible à tous les joueurs.",
    "dialog.home.list.2": "Modifiez le contenu vanilla sans écrire de code.",
    "dialog.home.list.3": "Aperçu en temps réel de vos modifications.",
    "dialog.overview.title": "Pages d'aperçu",
    "dialog.overview.body": "Les pages d'aperçu vous permettent de parcourir et naviguer rapidement entre les éléments. Passez d'un élément à un autre facilement à travers tous les concepts.",
    "dialog.overview.list.1": "Vues grille et liste selon vos préférences.",
    "dialog.overview.list.2": "Barre de recherche pour trouver rapidement un élément.",
    "dialog.overview.list.3": "Options rapides pour filtrer et trier le contenu.",
    "dialog.edit.title": "Configurer les éléments",
    "dialog.edit.body": "Cliquez sur 'Configurer' depuis n'importe quel aperçu pour accéder aux pages d'édition détaillées. Ajustez le game design, l'équilibrage ou désactivez des éléments.",
    "dialog.edit.list.1": "Affinez l'équilibrage avec des contrôles intuitifs.",
    "dialog.edit.list.2": "Activez ou désactivez facilement des éléments spécifiques.",
    "dialog.simulation.title": "Mode simulation",
    "dialog.simulation.body": "Certains concepts offrent une simulation pour prévisualiser vos changements en jeu. Obtenez des statistiques et informations pertinentes dans un format clair et accessible.",
    "dialog.simulation.list.1": "Prévisualisez vos changements tels qu'ils apparaîtront dans Minecraft.",
    "dialog.simulation.list.2": "Consultez les statistiques et probabilités détaillées.",
    "dialog.simulation.list.3": "Testez différentes configurations instantanément.",
    "dialog.debug.title": "Mode debug",
    "dialog.debug.body": "Activez le mode debug dans les paramètres pour accéder aux informations avancées. Inspectez le contenu des fichiers avant et après modification en toute transparence.",
    "dialog.debug.list.1": "Visualisez les données brutes et la structure des fichiers.",
    "dialog.debug.list.2": "Comparez le contenu original et modifié.",
    "dialog.debug.list.3": "Utile pour le dépannage et l'apprentissage.",
    "dialog.export.title": "Exporter votre travail",
    "dialog.export.body": "Exportez vos créations dans plusieurs formats. Studio gère automatiquement la conversion de datapack vers mod.",
    "dialog.export.list.1": "Exportez en .zip datapack pour Minecraft vanilla.",
    "dialog.export.list.2": "Exportez en .jar mod prêt pour les mod loaders.",
    "dialog.export.list.3": "Intégration GitHub pour push et pull requests."
}
