{
    "minecraft:ammo_use": "Amount of ammunition used when firing a bow or crossbow.",
    "minecraft:armor_effectiveness": "Effectiveness of the target's armor during an attack. 0 means completely ineffective; 1 means fully effective.",
    "minecraft:attributes": "Modifies player statistics when the weapon is equipped or held.",
    "minecraft:block_experience": "Performs a mathematical operation on the experience gained from breaking a block.",
    "minecraft:crossbow_charge_time": "Time required to fully charge the crossbow.",
    "minecraft:crossbow_charging_sounds": "Plays a sound when the crossbow is fully charged.",
    "minecraft:damage": "Amount of damage dealt by an attack.",
    "minecraft:damage_immunity": "Grants immunity to damage under certain conditions.",
    "minecraft:damage_protection": "Reduces the amount of damage received from attacks.",
    "minecraft:equipment_drops": "Chance of equipment dropping from a killed entity. Value ranges from 0 to 1.",
    "minecraft:fishing_luck_bonus": "Increases the player's luck when fishing.",
    "minecraft:fishing_time_reduction": "Reduces the time it takes to catch a fish.",
    "minecraft:hit_block": "Triggers an action when the player or a projectile hits a block.",
    "minecraft:item_damage": "Amount of durability lost when an item is damaged.",
    "minecraft:knockback": "Amount of knockback caused by an attack.",
    "minecraft:location_changed": "Triggers an action when the player changes location.",
    "minecraft:mob_experience": "Performs a mathematical operation on the experience gained from killing a mob.",
    "minecraft:post_attack": "Triggers an action after an attack.",
    "minecraft:prevent_armor_change": "Prevents the player from unequipping armor.",
    "minecraft:prevent_equipment_drop": "Prevents the item from dropping when the player dies.",
    "minecraft:projectile_count": "Increases the number of projectiles fired.",
    "minecraft:projectile_piercing": "Changes the number of entities a projectile can pierce.",
    "minecraft:projectile_spawned": "Triggers an action when a projectile is spawned.",
    "minecraft:projectile_spread": "Alters the spread distance between projectiles.",
    "minecraft:repair_with_xp": "Performs a mathematical operation on the weapon's durability when experience is gained.",
    "minecraft:smash_damage_per_fallen_block": "Performs a mathematical operation on damage based on the number of blocks fallen.",
    "minecraft:tick": "Triggers an action on every game tick.",
    "minecraft:trident_return_acceleration": "Changes the speed at which a trident returns to the player.",
    "minecraft:trident_sound": "Plays a sound when the trident is thrown.",
    "minecraft:trident_spin_attack_strength": "Modifies the strength of the trident's spin attack."
}
